app/controllers/shop_controller.rb

SELECT "shops".* FROM "shops"
---
	def list

		@shops=Shop.all